avr-rust/avrd/packs/xmegaa/ATxmega128A1.atdf
        <register caption="Clock and Event Out Register" name="CLKEVOUT" offset="0x04" size="1">
          <bitfield caption="Clock Output Port" mask="0x03" name="CLKOUT" values="PORTCFG_CLKOUT"/>
          <bitfield caption="Event Output Port" mask="0x30" name="EVOUT" values="PORTCFG_EVOUT"/>
        </register>
      </register-group>
      <register-group caption="Virtual Port" name="VPORT" size="4">
        <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
        <register caption="I/O Port Output" name="OUT" offset="0x01" size="1"/>
        <register caption="I/O Port Input" name="IN" offset="0x02" size="1"/>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
          <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
        </register>
      </register-group>
      <register-group caption="I/O Ports" name="PORT" size="24">
        <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
        <register caption="I/O Port Data Direction Set" name="DIRSET" offset="0x01" size="1"/>
        <register caption="I/O Port Data Direction Clear" name="DIRCLR" offset="0x02" size="1"/>
        <register caption="I/O Port Data Direction Toggle" name="DIRTGL" offset="0x03" size="1"/>
        <register caption="I/O Port Output" name="OUT" offset="0x04" size="1"/>
        <register caption="I/O Port Output Set" name="OUTSET" offset="0x05" size="1"/>
        <register caption="I/O Port Output Clear" name="OUTCLR" offset="0x06" size="1"/>
        <register caption="I/O Port Output Toggle" name="OUTTGL" offset="0x07" size="1"/>
        <register caption="I/O port Input" name="IN" offset="0x08" size="1"/>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x09" size="1">
          <bitfield caption="Port Interrupt 1 Level" mask="0x0C" name="INT1LVL" values="PORT_INT1LVL"/>
          <bitfield caption="Port Interrupt 0 Level" mask="0x03" name="INT0LVL" values="PORT_INT0LVL"/>
        </register>
        <register caption="Port Interrupt 0 Mask" name="INT0MASK" offset="0x0A" size="1"/>
        <register caption="Port Interrupt 1 Mask" name="INT1MASK" offset="0x0B" size="1"/>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
          <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
        </register>
        <register caption="Pin 0 Control Register" name="PIN0CTRL" offset="0x10" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 1 Control Register" name="PIN1CTRL" offset="0x11" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 2 Control Register" name="PIN2CTRL" offset="0x12" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 3 Control Register" name="PIN3CTRL" offset="0x13" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 4 Control Register" name="PIN4CTRL" offset="0x14" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 5 Control Register" name="PIN5CTRL" offset="0x15" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 6 Control Register" name="PIN6CTRL" offset="0x16" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 7 Control Register" name="PIN7CTRL" offset="0x17" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
      </register-group>
      <value-group caption="Virtual Port 0 Mapping" name="PORTCFG_VP0MAP">
        <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
        <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
        <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
        <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
        <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
        <value caption="Mapped To PORTF" name="PORTF" value="0x05"/>
        <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
        <value caption="Mapped To PORTH" name="PORTH" value="0x07"/>
        <value caption="Mapped To PORTJ" name="PORTJ" value="0x08"/>
        <value caption="Mapped To PORTK" name="PORTK" value="0x09"/>
        <value caption="Mapped To PORTL" name="PORTL" value="0x0A"/>
        <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
        <value caption="Mapped To PORTN" name="PORTN" value="0x0C"/>
        <value caption="Mapped To PORTP" name="PORTP" value="0x0D"/>
        <value caption="Mapped To PORTQ" name="PORTQ" value="0x0E"/>
        <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
      </value-group>
      <value-group caption="Virtual Port 1 Mapping" name="PORTCFG_VP1MAP">
        <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
        <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
        <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
        <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
        <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
        <value caption="Mapped To PORTF" name="PORTF" value="0x05"/>
        <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
        <value caption="Mapped To PORTH" name="PORTH" value="0x07"/>
        <value caption="Mapped To PORTJ" name="PORTJ" value="0x08"/>
        <value caption="Mapped To PORTK" name="PORTK" value="0x09"/>
        <value caption="Mapped To PORTL" name="PORTL" value="0x0A"/>
        <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
        <value caption="Mapped To PORTN" name="PORTN" value="0x0C"/>
        <value caption="Mapped To PORTP" name="PORTP" value="0x0D"/>
        <value caption="Mapped To PORTQ" name="PORTQ" value="0x0E"/>
        <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
      </value-group>
