avr-rust/avrd/packs/xmegaa/ATxmega128A1.atdf
        <register caption="Interrupt Control Register A" name="INTCTRLA" offset="0x06" size="1">
          <bitfield caption="Error Interrupt Level" mask="0x0C" name="ERRINTLVL" values="TC_ERRINTLVL"/>
          <bitfield caption="Overflow interrupt level" mask="0x03" name="OVFINTLVL" values="TC_OVFINTLVL"/>
        </register>
        <register caption="Interrupt Control Register B" name="INTCTRLB" offset="0x07" size="1">
          <bitfield caption="Compare or Capture B Interrupt Level" mask="0x0C" name="CCBINTLVL" values="TC_CCBINTLVL"/>
          <bitfield caption="Compare or Capture A Interrupt Level" mask="0x03" name="CCAINTLVL" values="TC_CCAINTLVL"/>
        </register>
        <register caption="Control Register F Clear" name="CTRLFCLR" offset="0x08" size="1">
          <bitfield caption="Command" mask="0x0C" name="CMD"/>
          <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
          <bitfield caption="Direction" mask="0x01" name="DIR"/>
        </register>
        <register caption="Control Register F Set" name="CTRLFSET" offset="0x09" size="1">
          <bitfield caption="Command" mask="0x0C" name="CMD" values="TC_CMD"/>
          <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
          <bitfield caption="Direction" mask="0x01" name="DIR"/>
        </register>
        <register caption="Control Register G Clear" name="CTRLGCLR" offset="0x0A" size="1">
          <bitfield caption="Compare or Capture B Buffer Valid" mask="0x04" name="CCBBV"/>
          <bitfield caption="Compare or Capture A Buffer Valid" mask="0x02" name="CCABV"/>
          <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
        </register>
        <register caption="Control Register G Set" name="CTRLGSET" offset="0x0B" size="1">
          <bitfield caption="Compare or Capture B Buffer Valid" mask="0x04" name="CCBBV"/>
          <bitfield caption="Compare or Capture A Buffer Valid" mask="0x02" name="CCABV"/>
          <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
        </register>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Compare or Capture B Interrupt Flag" mask="0x20" name="CCBIF"/>
          <bitfield caption="Compare or Capture A Interrupt Flag" mask="0x10" name="CCAIF"/>
          <bitfield caption="Error Interrupt Flag" mask="0x02" name="ERRIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
        </register>
        <register caption="Temporary Register For 16-bit Access" name="TEMP" offset="0x0F" size="1"/>
        <register caption="Count" name="CNT" offset="0x20" size="2"/>
        <register caption="Period" name="PER" offset="0x26" size="2"/>
        <register caption="Compare or Capture A" name="CCA" offset="0x28" size="2"/>
        <register caption="Compare or Capture B" name="CCB" offset="0x2A" size="2"/>
        <register caption="Period Buffer" name="PERBUF" offset="0x36" size="2"/>
        <register caption="Compare Or Capture A Buffer" name="CCABUF" offset="0x38" size="2"/>
        <register caption="Compare Or Capture B Buffer" name="CCBBUF" offset="0x3A" size="2"/>
      </register-group>
      <register-group caption="Advanced Waveform Extension" name="AWEX" size="13">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Pattern Generation Mode" mask="0x20" name="PGM"/>
          <bitfield caption="Common Waveform Channel Mode" mask="0x10" name="CWCM"/>
          <bitfield caption="Dead Time Insertion Compare Channel D Enable" mask="0x08" name="DTICCDEN"/>
          <bitfield caption="Dead Time Insertion Compare Channel C Enable" mask="0x04" name="DTICCCEN"/>
          <bitfield caption="Dead Time Insertion Compare Channel B Enable" mask="0x02" name="DTICCBEN"/>
          <bitfield caption="Dead Time Insertion Compare Channel A Enable" mask="0x01" name="DTICCAEN"/>
        </register>
        <register caption="Fault Detection Event Mask" name="FDEMASK" offset="0x02" size="1"/>
        <register caption="Fault Detection Control Register" name="FDCTRL" offset="0x03" size="1">
          <bitfield caption="Fault Detect on Disable Break Disable" mask="0x10" name="FDDBD"/>
          <bitfield caption="Fault Detect Mode" mask="0x04" name="FDMODE"/>
          <bitfield caption="Fault Detect Action" mask="0x03" name="FDACT" values="AWEX_FDACT"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x04" size="1">
          <bitfield caption="Fault Detect Flag" mask="0x04" name="FDF"/>
          <bitfield caption="Dead Time High Side Buffer Valid" mask="0x02" name="DTHSBUFV"/>
          <bitfield caption="Dead Time Low Side Buffer Valid" mask="0x01" name="DTLSBUFV"/>
        </register>
        <register caption="Dead Time Both Sides" name="DTBOTH" offset="0x06" size="1"/>
        <register caption="Dead Time Both Sides Buffer" name="DTBOTHBUF" offset="0x07" size="1"/>
        <register caption="Dead Time Low Side" name="DTLS" offset="0x08" size="1"/>
        <register caption="Dead Time High Side" name="DTHS" offset="0x09" size="1"/>
        <register caption="Dead Time Low Side Buffer" name="DTLSBUF" offset="0x0A" size="1"/>
        <register caption="Dead Time High Side Buffer" name="DTHSBUF" offset="0x0B" size="1"/>
        <register caption="Output Override Enable" name="OUTOVEN" offset="0x0C" size="1"/>
      </register-group>
      <register-group caption="High-Resolution Extension" name="HIRES" size="1">
        <register caption="Control Register" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="High Resolution Enable" mask="0x03" name="HREN" values="HIRES_HREN"/>
        </register>
      </register-group>
      <value-group caption="Clock Selection" name="TC_CLKSEL">
        <value caption="Timer Off" name="OFF" value="0x00"/>
        <value caption="System Clock" name="DIV1" value="0x01"/>
        <value caption="System Clock / 2" name="DIV2" value="0x02"/>
        <value caption="System Clock / 4" name="DIV4" value="0x03"/>
        <value caption="System Clock / 8" name="DIV8" value="0x04"/>
        <value caption="System Clock / 64" name="DIV64" value="0x05"/>
        <value caption="System Clock / 256" name="DIV256" value="0x06"/>
        <value caption="System Clock / 1024" name="DIV1024" value="0x07"/>
        <value caption="Event Channel 0" name="EVCH0" value="0x08"/>
        <value caption="Event Channel 1" name="EVCH1" value="0x09"/>
        <value caption="Event Channel 2" name="EVCH2" value="0x0A"/>
        <value caption="Event Channel 3" name="EVCH3" value="0x0B"/>
        <value caption="Event Channel 4" name="EVCH4" value="0x0C"/>
        <value caption="Event Channel 5" name="EVCH5" value="0x0D"/>
        <value caption="Event Channel 6" name="EVCH6" value="0x0E"/>
        <value caption="Event Channel 7" name="EVCH7" value="0x0F"/>
      </value-group>
      <value-group caption="Waveform Generation Mode" name="TC_WGMODE">
        <value caption="Normal Mode" name="NORMAL" value="0x00"/>
        <value caption="Frequency Generation Mode" name="FRQ" value="0x01"/>
        <value caption="Single Slope" name="SS" value="0x03"/>
        <value caption="Dual Slope, Update on TOP" name="DS_T" value="0x05"/>
        <value caption="Dual Slope, Update on TOP and BOTTOM" name="DS_TB" value="0x06"/>
        <value caption="Dual Slope, Update on BOTTOM" name="DS_B" value="0x07"/>
      </value-group>
      <value-group caption="Event Action" name="TC_EVACT">
        <value caption="No Event Action" name="OFF" value="0x00"/>
        <value caption="Input Capture" name="CAPT" value="0x01"/>
        <value caption="Externally Controlled Up/Down Count" name="UPDOWN" value="0x02"/>
        <value caption="Quadrature Decode" name="QDEC" value="0x03"/>
        <value caption="Restart" name="RESTART" value="0x04"/>
        <value caption="Frequency Capture" name="FRQ" value="0x05"/>
        <value caption="Pulse-width Capture" name="PW" value="0x06"/>
      </value-group>
